//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом
Console.WriteLine("Введите пятизначное число");
int Num = Convert.ToInt32(Console.ReadLine());
string NumberText = Convert.ToString(Num);
if(NumberText[0] == NumberText[4])
{
    Console.WriteLine("является палиндромом");
}
else if(NumberText[1] == NumberText [3])
{
    Console.WriteLine("является палиндромом");
}
else
{
    Console.WriteLine("не является палиндромом");
}
